Tekla Open API Reference for Tekla Structures 2025
Integer Constructor
 Creates a new integer datatype instance.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Integer(
	int value
)
Public Sub New (
	value As Integer
)
Parameters
value
Type: System.Int32
The value for the integer datatype.
See Also
Reference
Integer Structure
Tekla.Structures.Datatype Namespace